/**
 * 4. Поиск текста в файле.
 * Нужно осуществлять обход файловой системы и поиск заданного текста в файловой системе.
 * Приложения должно искать текст в файлах (в том числе и в подкаталогах) и сохранять адрес файла.
 * По желанию можно использовать потокобезопасные коллекции JDK.
 * Логика приложения:
 * 1. Запустить код.
 * 2. Внутри запустить несколько потоков. Объяснить для чего нужно делать потоки.
 * 3. Дождаться завершения поиска.
 * 4. Вывести на консоль результат.
 * @version 1.0
 */
package ru.job4j.h4waitnotifynotifyall.t4parallelsearch;