/**
 * 2. Сделать ожидание вывода [#1017].
 * Необходимо, чтобы в начале запуска программы из первой части на экране выводилась информация о программе.
 * А после вычисления данных выводилась запись о завершении программы. Важно, эта информация всегда должна выводиться
 * в начале и в конце вычисления. Использовать метод sleep тут нельзя.
 *
 * В этом пакете - класс, расширяющий класс из пред.пакета.
 * Здесь два доп.потока присоединяются к ожидающему их основному потоку.
 * There's the class that extends the class from the previous package.
 * Here the main thread waits for two additional threads to be joined.
 * @version 1.0
 */
package ru.job4j.h1threads.t2outputstandby;